NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/mesh/snappyHexMesh/addLayersToFaceZone/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m s^-1];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    minX
    {
        type            uniformFixedValue;
        uniformValue    (1 0 0);
    }
    maxX
    {
        type            zeroGradient;
    }

    wall
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
}


// ************************************************************************* //
