NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/mesh/snappyHexMesh/addLayersToFaceZone/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication snappyHexMesh -overwrite

runApplication checkMesh

runApplication simpleFoam

#------------------------------------------------------------------------------
